app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT `questions`.* FROM `questions`

    def set_question
      @question = Question.find(params[:id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1