app/controllers/question_audios_controller.rb

SELECT `question_audios`.* FROM `question_audios`
---
  def index
    @question_audios = QuestionAudio.all

SELECT `question_audios`.* FROM `question_audios` WHERE `question_audios`.`id` = 1 LIMIT 1
---
    def set_question_audio
      @question_audio = QuestionAudio.find(params[:id])